# Homebrew Bundle
#
# Install Homebrew:
# % bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#
# Run Homebrew Bundle to install everything below:
# % brew bundle -v

brew 'age'
brew 'b3sum'
brew 'bash'
brew 'curl' # keg-only
brew 'fzf'
brew 'git'
brew 'gron'
brew 'jq'
brew 'mas'
brew 'mosh'
brew 'mtr'
brew 'nmap'
brew 'openssh'
brew 'openssl' # keg-only
brew 'parallel'
brew 'pass'
brew 'ripgrep'
brew 'shellcheck'
brew 'tcptraceroute'
brew 'tmux'
brew 'tor'
brew 'vim'
brew 'xz'
brew 'ykman'
brew 'zstd'

## Homebrew Cask Apps
cask_args appdir: '~/Applications'
tap 'homebrew/cask-versions' # for google-chrome-beta, tor-browser-alpha, etc.

cask 'appcleaner'
cask 'bettertouchtool'
# Chrome has to go under /Applications for 1Password's signature verification
cask 'google-chrome-beta', args: { appdir: '/Applications' }
cask 'iterm2'
cask 'tor-browser-alpha'

## Fonts
tap 'homebrew/cask-fonts'
cask 'font-go'
cask 'font-jetbrains-mono'

## App Store Apps
mas '1Password 7', id: 1333542190
mas 'WireGuard', id: 1451685025
mas 'Yubico Authenticator', id: 1497506650
